app/controllers/store_controller.rb

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2010-02-15 05:05:57', 3, 3, 1, 89.85, '2010-02-15 05:05:57')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('Alan Rafael', 'rua amazonas, 74', '2010-02-15 05:05:57', '2010-02-15 05:05:57', 'cc', 'alanrrb@gmail.com')