app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('alan', '21822300200.287161154073184', '2010-02-15 18:22:50', '2010-02-15 18:22:50', 'a6528ec0a1749771146f8e3862b8b4c2100208c6')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-02-15 21:19:21', `salt` = '21826086000.96251274045229', `hashed_password` = '9bb0098ad1c689deae89ed53bbc51a192e4a7739' WHERE `id` = 1